RhinoInside.Revit API Documentation
GeometryEncoder.ToSolid Method (Brep)
 Converts the specified Rhino.Geometry.Brep to an equivalent of Autodesk.Revit.DB.Solid.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Solid ToSolid(
	this Rhino.Geometry.Brep brep
)
@staticmethod
def ToSolid(
	brep: Rhino.Geometry.Brep
) -> Autodesk.Revit.DB.Solid
Parameters
brep
Type: Rhino.Geometry.Brep
Rhino brep to convert.
Return Value
Type: Autodesk.Revit.DB.Solid
Revit solid that is equivalent to the provided Rhino brep.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Brep. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToSolid(Brep) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Solid revitSolid = rhinoBrep.ToSolid();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_solid: DB.Solid = rhino_brep.ToSolid()
 Using ToSolid(Brep) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Solid revitSolid = GeometryEncoder.ToSolid(rhinoBrep);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_solid: DB.Solid = ge.ToSolid(rhino_brep)
See Also
Reference
GeometryEncoder Class
ToSolid Overload
RhinoInside.Revit.Convert.Geometry Namespace